#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Accadius/kubernetes-ops-staging-sample-app/runs/run-c6CBxfsxRLzFFi1N

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.eks: Reading...
data.terraform_remote_state.route53_hosted_zone: Reading...
data.template_file.helm_values: Reading...
data.template_file.helm_values: Read complete after 0s [id=2471152a8c63d2967392e93534eec59deba681e61b7dac351e94f0e28e20595f]
data.terraform_remote_state.route53_hosted_zone: Read complete after 0s
data.terraform_remote_state.eks: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubernetes_ingress_v1.sample-app will be created
  + resource "kubernetes_ingress_v1" "sample-app" {
      + id                     = (known after apply)
      + status                 = (known after apply)
      + wait_for_load_balancer = true

      + metadata {
          + annotations      = {
              + "cert-manager.io/cluster-issuer" = "letsencrypt"
              + "kubernetes.io/ingress.class"    = "nginx"
            }
          + generation       = (known after apply)
          + name             = "sample-app"
          + namespace        = "sample-app"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + ingress_class_name = (known after apply)

          + rule {
              + host = "api.k8s.staging.accadius.com"

              + http {
                  + path {
                      + path_type = "ImplementationSpecific"

                      + backend {
                          + service {
                              + name = "sample-app-standard-application"

                              + port {
                                  + number = 443
                                }
                            }
                        }
                    }
                }
            }

          + tls {
              + hosts       = [
                  + "api.k8s.staging.accadius.com",
                ]
              + secret_name = "tls-sample-app"
            }
        }
    }

  # module.sample-app.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "standard-application"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "sample-app"
      + namespace                  = "sample-app"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://helm-charts.managedkube.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                labels: 
                  app: sample-app
                
                deployment:
                  containers:
                  - name: sample-app
                    image:
                      repository: 954793382213.dkr.ecr.us-east-1.amazonaws.com/sample-repo
                      tag: sample-app8
                    resources:
                      requests:
                        cpu: 500m
                        memory: 64Mi
                      limits:
                        cpu: 1500m
                        memory: 128Mi
                    ports:
                    - name: https
                      protocol: TCP
                      containerPort: 80
                      servicePort: 443
                    env:
                      base: []
                      perEnv:
                        - name: LOG_LEVEL
                          value: WARNING
                        - name: SESSION_EXPIRATION_DURATION
                          value: "7200"
                
                hpa:
                  enabled: true
                  spec:
                    scaleTargetRef:
                      apiVersion: apps/v1
                      kind: Deployment
                      # Update to match the name of your deployment
                      name: "sample-app-standard-application"
                    minReplicas: 1
                    maxReplicas: 4
                    targetCPUUtilizationPercentage: 50
            EOT,
          + "",
        ]
      + verify                     = false
      + version                    = "1.0.12"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 2 estimated
           $0.0/mo +$0.0

```


</details>

*Pusher: @yaccad, Action: `pull_request`*